#კომენტარი ტექსტია რომელსაც პროგრამა არ ასრულებს იქმნება # სიმბოლით და გამოიყენება კოდის ასახსნელად
#case-sensetive ნიშნავს რომ ასოების დიდი და პატარა ფორმა სხვადასხვად ითვლება მაგალითად "Name" და "name" სხვადასხვა ცვლადებია
#snake case მართლწერის სინტაქსი როდესაც ორი აზრობრივად დაკავშირებულ მნიშვნელობებს ერთმანეთში space-ის ნაცვლად ვაერთებთ _ - თი
my_name="Mari "
my_age="14 "
my_city="Tbilisi"
print("my name is " + my_name + "i am " + my_age + "i am from " + my_city)
#bug - შეცდომა, როდესაც პროგრამა არასწორად მუშაობს
#debugging - პროცესი როდესაც ვცდილობთ ვიპოვოთ და გამოვასწოროთ შეცდომები (bug)
print("hello world")
city="London"
print(city)