#2)
#  ფუნქცია არის კოდის ნაწილი რომელსაც აქვს სახელი ფუნქცია ასრულებს კონკრეტულ დავალებას
# მისი გამოყენება შეგვიძლია ბევრჯერ, კოდის თავიდან დაწერის გარეშე

#3)
# print() არის ჩაშენებული ფუნქცია print() ფუნქცია გამოიყენება ინფორმაციის ეკრანზე გამოსატანად
# მას გადავცემთ არგუმენტს და ის აჩვენებს შედეგს ტერმინალში

#4)
# არგუმენტები არის ის მონაცემები რომლებიც ფუნქციას გადაეცემა ფრჩხილებში ()
# მაგალითად print("Hello") აქ "Hello" არის არგუმენტი

#5)
name="mari"
surname="dekanosidze"
age="14"
fav_academy="GOA"
print(f"my name is {name,surname} i'am {age} and my favorite academy is {fav_academy}")