# list - სიის საშუალებით უფლება გვაქ ერთ ცვლადში შევინახოთ რამდენიმე მნიშვნელობა
numbers = [75234, 345665, 56, 364785467, 45]
# ინდექსი არის ელემენტის პოზიცია სიაში
names = ["Nia", "Gigi", "Anna", "Lilu", "Mari", "Saba", "Tini"]
names[1] = "Datuna"
names[5] = "Nanuka"
print(names)
blabla= [3456, "apefgle", 3.14, True, "banaa", 675432, "cafsr"]
print(blabla[1], blabla[3], blabla[5]) #ელემენტები გამოგვაქ კვადრატული ფრჩხილებიტ და სესაბამისი ინდექსით
# ცვლადი ინახავს მხოლოდ ერთ მნიშვნელობას ლისტი ინახავს რამდენიმე მნიშვნელობას ერთ ცვლადში