#2
# Custom ფუნქცია არის ისეთი ფუნქცია,რომელსაც ჩვენ თვითონ ვწერთ კონკრეტული ამოცანის შესასრულებლად.
# კოდის გამარტივებისთვის ერთი და იგივე კოდის თავიდან არ დასაწერად
# 1) ვიყენებთ საკვანძო სიტყვას def
# 2) ვწერთ ფუნქციის სახელს
# 3) ფრჩხილებში ვუთითებთ პარამეტრებს
# 4) ვწერთ ფუნქციის სხეულის კოდს
# პარამეტრები — ეს არის ცვლადები რომლებიც ფუნქციას გადაეცემა შექმნის დროს
# არგუმენტები — ეს არის მნიშვნელობები რომლებსაც ფუნქციას გამოძახებისას ვაწვდით

#3
def sum_numbers(num1, num2):
    print(num1+num2)
sum_numbers(12,23)

#4
def check(num):
    if num % 2 == 0:
        print("ლუწია")
    else:
        print("კენტია")
check(78)

#5
def square(num):
    print(num * num)
square(23)

#6
def uppercase(text):
    print(text.upper())
uppercase("nian")

#7
def full_name(name, surname):
    print(f"ჩემი სახელია {name} და გვარია {surname}")
full_name("igi","gignize")
    